//package Test;
//
//public class Test_01 {
//	public static void main(String[] args) {
//
//		// 1번 수포자가 찍는 방식: 1, 2, 3, 4, 5, 1, 2, 3, 4, 5, ...
//		// 2번 수포자가 찍는 방식: 2, 1, 2, 3, 2, 4, 2, 5, 2, 1, 2, 3, 2, 4, 2, 5, ...
//		// 3번 수포자가 찍는 방식: 3, 3, 1, 1, 2, 2, 4, 4, 5, 5, 3, 3, 1, 1, 2, 2, 4, 4,
//		// 5, 5, ...
//		int n = 16;
//		int count = 0;
//		int[] a = new int[n];
//		int[] b = new int[n];
//		int[] c = new int[n];
//		for (int i = 1; i < n+1; i++){
//			if{i%6==
//				a[count] = i;
//				count++;
//		}
//		for (int i = 0; i < n+1; i++) {
//			
//		}
//
//	}
//
//}

// /오버 라이딩 - > 메소드를 상속 받을때 부모의 메소드를 자식이 그대로 가져올때 자식의 변수 r도 넣어서 메소드 값을 변형시킬 수 있다.
// 추상 클레스 : abstract clss -> 설계에 필요한 수식들을 부모로 두고 자식이 그 설계를 완성시킬 재료들(변수 or 매소드)을
// 가진 것.

// 인터페이스 시스템
